<template>
    <div class="reviews-slider">
        <div class="container">


            <swiper :pagination="{
              clickable: true,
            }" :modules="modules" :autoplay="{
              delay: 5000,
              disableOnInteraction: false,
            }" :autoHeight="true" class="mySwiper">
                <swiper-slide v-for="(item,index) in visitors" :key="index"><ReviewsCard :visitor="item"/></swiper-slide>

            </swiper>


        </div>
    </div>




</template>
<script>
import { Swiper, SwiperSlide } from "swiper/vue";
import ReviewsCard from './Reviews.vue'

import "swiper/css";

import "swiper/css/pagination";

import { Pagination,Autoplay } from "swiper";
import {ref} from 'vue'

export default {
    name: 'ReviewsSlider',
    props: {
        msg: String
    },
    components: {
        Swiper,
        SwiperSlide,
        ReviewsCard,
    },
    setup() {
        const visitors = ref([
           
            { 
                text:"Я надолго запомню мой День рождения, проведённый в этом ресторане! Кусочек родной Армении!!! Отдельное спасибо за комплепент в виде фруктовой тарелки. Будем рекомендовать этот ресторан своим друзьям и родственникам также за рубежом, путешествующих в Санкт-Петербург!!!",
                statusPerson:"Посетитель",
                name:"Иван"
            },
            { 
                text:"Я надолго запомню мой День рождения, проведённый в этом ресторане! Кусочек родной Армении!!! Отдельное спасибо за комплепент в виде фруктовой тарелки. Будем рекомендовать этот ресторан своим друзьям и родственникам также за рубежом, путешествующих в Санкт-Петербург!!!Я надолго запомню мой День рождения, проведённый в этом ресторане! Кусочек родной Армении!!! Отдельное спасибо за комплепент в виде фруктовой тарелки. Будем рекомендовать этот ресторан своим друзьям и родственникам также за рубежом, путешествующих в Санкт-Петербург!!!Я надолго запомню мой День рождения, проведённый в этом ресторане! Кусочек родной Армении!!! Отдельное спасибо за комплепент в виде фруктовой тарелки. Будем рекомендовать этот ресторан своим друзьям и родственникам также за рубежом, путешествующих в Санкт-Петербург!!!",
                statusPerson:"Посетитель",
                name:"Николай"
            },
            { 
                text:"Я надолго запомню мой День рождения, проведённый в этом ресторане! Кусочек родной Армении!!! Отдельное спасибо за комплепент в виде фруктовой тарелки. Будем рекомендовать этот ресторан своим друзьям и родственникам также за рубежом, путешествующих в Санкт-Петербург!!!",
                statusPerson:"Посетитель",
                name:"Степан"
            },
            { 
                text:"Я надолго запомню мой День рождения, проведённый в этом ресторане! Кусочек родной Армении!!! Отдельное спасибо за комплепент в виде фруктовой тарелки. Будем рекомендовать этот ресторан своим друзьям и родственникам также за рубежом, путешествующих в Санкт-Петербург!!!",
                statusPerson:"Посетитель",
                name:"Петр"
            },
            { 
                text:"Я надолго запомню мой День рождения, проведённый в этом ресторане! Кусочек родной Армении!!! Отдельное спасибо за комплепент в виде фруктовой тарелки. Будем рекомендовать этот ресторан своим друзьям и родственникам также за рубежом, путешествующих в Санкт-Петербург!!!",
                statusPerson:"Посетитель",
                name:"Инокентий"
            },
        ])
        return {
            modules: [Pagination,Autoplay],
            visitors
        };
    },
}
</script>